---
type: GeometryCreationUtilities
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# GeometryCreationUtilities

`Autodesk.Revit.DB.GeometryCreationUtilities` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | CreateBlendGeometry | — | `` |
| Method | CreateExtrusionGeometry | — | `` |
| Method | CreateFixedReferenceSweptGeometry | — | `` |
| Method | CreateLoftGeometry | 2016 | `public static Solid CreateLoftGeometry ( IList < CurveLoop > profileLoops , SolidOptions solidOptions )` |
| Method | CreateRevolvedGeometry | — | `` |
| Method | CreateSweptBlendGeometry | — | `` |
| Method | CreateSweptGeometry | — | `` |